a76664289/KlipperScreen-esp/src/ports/esp32/sdkconfig.defaults.ESP32-3248S035C
# 板型：ESP32-3248S035C（ESP32，3.5" 320x480 ST7796 SPI + GT911）
CONFIG_IDF_TARGET="esp32"
CONFIG_BOARD_ESP32_3248S035C=y

# Flash 4MB 80MHz QIO
CONFIG_ESPTOOLPY_FLASHMODE_QIO=y
CONFIG_ESPTOOLPY_FLASHFREQ_80M=y
CONFIG_ESPTOOLPY_FLASHSIZE_4MB=y
CONFIG_ESPTOOLPY_FLASHSIZE="4MB"

# CPU 240MHz
CONFIG_ESP32_DEFAULT_CPU_FREQ_240=y

# 无 PSRAM（ESP32 经典版内部 SRAM 足够）
# CONFIG_SPIRAM is not set

# 分区表
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions_esp32_3248s035c.csv"
CONFIG_PARTITION_TABLE_FILENAME="partitions_esp32_3248s035c.csv"

# 编译优化：-Og（和 e32r35t、esp32-ST7796-320_240-ec11 一致）
# 4MB Flash 空间紧张，-Og 体积最小最稳
CONFIG_COMPILER_OPTIMIZATION_DEBUG=y
# CONFIG_COMPILER_OPTIMIZATION_SIZE is not set
# CONFIG_COMPILER_OPTIMIZATION_PERF is not set

# LVGL 刷新周期
CONFIG_LV_DEF_REFR_PERIOD=33

# 关闭旋转编码器（3248S035C 没编码器，GPIO27 是背光，会冲突）
# CONFIG_INPUT_ROTARY_ENCODER is not set

# 字体（ui_layout.c 用到 14/24/28/48）
CONFIG_LV_FONT_MONTSERRAT_12=y
CONFIG_LV_FONT_MONTSERRAT_14=y
CONFIG_LV_FONT_MONTSERRAT_16=y
# CONFIG_LV_FONT_MONTSERRAT_18 is not set
# CONFIG_LV_FONT_MONTSERRAT_20 is not set
# CONFIG_LV_FONT_MONTSERRAT_22 is not set
CONFIG_LV_FONT_MONTSERRAT_24=y
# CONFIG_LV_FONT_MONTSERRAT_26 is not set
CONFIG_LV_FONT_MONTSERRAT_28=y
# CONFIG_LV_FONT_MONTSERRAT_30 is not set
CONFIG_LV_FONT_MONTSERRAT_32=y
# CONFIG_LV_FONT_MONTSERRAT_34 is not set
# CONFIG_LV_FONT_MONTSERRAT_36 is not set
# CONFIG_LV_FONT_MONTSERRAT_38 is not set
# CONFIG_LV_FONT_MONTSERRAT_40 is not set
# CONFIG_LV_FONT_MONTSERRAT_42 is not set
# CONFIG_LV_FONT_MONTSERRAT_44 is not set
# CONFIG_LV_FONT_MONTSERRAT_46 is not set
CONFIG_LV_FONT_MONTSERRAT_48=y
CONFIG_LV_FONT_DEFAULT_MONTSERRAT_14=y
CONFIG_LV_FONT_FMT_TXT_LARGE=y
CONFIG_LV_USE_FONT_COMPRESSED=y